/**
 * ibase错误消息定义.
 */
export default {
  "0":"服务器异常，请联系管理员",
  "400": "请求参数有误",
  "401": "当前请求需要用户验证",
  "403": "服务器已经理解请求，但是拒绝执行它",
  "404": "请求失败，请求所希望得到的资源未在服务器上发现",
  "405": "请求行中指定的请求方法不能被用于请求相应的资源",
  "406": "请求的资源内容无法满足请求头中的条件",
  "408": "请求超时",
  "409": "请求的资源的当前状态之间存在冲突",
  "410": "请求资源不可用",
  "411": "服务器拒绝接受请求",
  "412": "请求的头字段中给出先决条件时，没能满足",
  "413": "请求提交的实体数据大小超过了服务器能够处理的范围",
  "414": "请求的URI长度超过了服务器能够解释的长度",
  "415": "提交的实体并不是服务器所支持的格式",
  "500": "服务器遇到了一个未曾预料的状况",
  "501": "服务器不支持当前请求所需要的某个功能",
  "503": "服务不可用",
  "504": "网关超时，请联系管理员"
};
